Ham0osh/PSoC-Programs/test_projects/Proj04-1_freefly_control.cydsn/Generated_Source/PSoC5/state_register.h
/*******************************************************************************
* File Name: state_register.h  
* Version 1.90
*
* Description:
*  This file containts Status Register function prototypes and register defines
*
* Note:
*
********************************************************************************
* Copyright 2008-2015, Cypress Semiconductor Corporation.  All rights reserved.
* You may use this file only in accordance with the license, terms, conditions, 
* disclaimers, and limitations in the end user license agreement accompanying 
* the software package with which this file was provided.
*******************************************************************************/

#if !defined(CY_STATUS_REG_state_register_H) /* CY_STATUS_REG_state_register_H */
#define CY_STATUS_REG_state_register_H

#include "cyfitter.h"

#if ((CYDEV_CHIP_FAMILY_USED == CYDEV_CHIP_FAMILY_PSOC3) || \
     (CYDEV_CHIP_FAMILY_USED == CYDEV_CHIP_FAMILY_PSOC4) || \
     (CYDEV_CHIP_FAMILY_USED == CYDEV_CHIP_FAMILY_PSOC5))
    #include "cytypes.h"
    #include "CyLib.h"
#else
    #include "syslib/cy_syslib.h"
#endif

    
/***************************************
*     Data Struct Definitions
***************************************/

/* Sleep Mode API Support */
typedef struct
{
    uint8 statusState;

} state_register_BACKUP_STRUCT;


/***************************************
*        Function Prototypes
***************************************/

uint8 state_register_Read(void) ;
void state_register_InterruptEnable(void) ;
void state_register_InterruptDisable(void) ;
void state_register_WriteMask(uint8 mask) ;
uint8 state_register_ReadMask(void) ;


/***************************************
*           API Constants
***************************************/

#define state_register_STATUS_INTR_ENBL    0x10u


/***************************************
*         Parameter Constants
***************************************/

/* Status Register Inputs */
#define state_register_INPUTS              8


/***************************************
*             Registers
***************************************/

/* Status Register */
#define state_register_Status             (* (reg8 *) state_register_sts_sts_reg__STATUS_REG )
#define state_register_Status_PTR         (  (reg8 *) state_register_sts_sts_reg__STATUS_REG )
#define state_register_Status_Mask        (* (reg8 *) state_register_sts_sts_reg__MASK_REG )
#define state_register_Status_Aux_Ctrl    (* (reg8 *) state_register_sts_sts_reg__STATUS_AUX_CTL_REG )

#endif /* End CY_STATUS_REG_state_register_H */


/* [] END OF FILE */
